In [1]:
#데이터프레임 행,열(row,columns)선택 및 필터하기
import pandas as pd

In [4]:
friend_list=[{'name': 'Jone', 'age':20,'job':'student'},
{'name':'Jenny','age':30,'job':None},
{'name':'yunju','age':23,'job':'student'}]
df=pd.DataFrame(friend_list)
df=df[['name','age','job']]

In [5]:
df

    name  age      job
0   Jone   20  student
1  Jenny   30     None
2  yunju   23  student

In [9]:
# Jenny와 Yunju데이터만 원하는 경우(index 1~2번만 필요)
df[1:3]

    name  age      job
1  Jenny   30     None
2  yunju   23  student

In [11]:

#그렇지만 df는 Jenny와 Yunju데이터 만을 가지진 않는다. df가 Jenny,Yunju데이터만을 가지게 하려면
df=df[1:3]

In [13]:
df  #df는 Jenny와 Yunju데이터만을 가짐.

    name  age      job
1  Jenny   30     None
2  yunju   23  student

In [14]:
friend_list=[{'name': 'Jone', 'age':20,'job':'student'},
{'name':'Jenny','age':30,'job':None},
{'name':'yunju','age':23,'job':'student'}]
df=pd.DataFrame(friend_list)
df=df[['name','age','job']]

In [16]:
#Jenny와 Yunju같이 연속적인 인덱스를 취하지 않는경우 이 예시에서는 John과 Yunju
df.loc[[0,2]]

    name  age      job
0   Jone   20  student
2  yunju   23  student

In [17]:
#column의 codition에 따라 row를 선택 //이번에는 나이가 30살 이상인 사람
df[df.age>=23]

    name  age      job
1  Jenny   30     None
2  yunju   23  student

In [18]:
df.query('age>=23')

    name  age      job
1  Jenny   30     None
2  yunju   23  student

In [20]:
df[(df.age>=23)&(df.name=='yunju')]

    name  age      job
2  yunju   23  student

# Filter Columns

## index

In [27]:
friend_list=[
    ['John',20,'student'],
    ['Jenny',30,'developer'],
    ['Yunju',23,'student']
]
df=pd.DataFrame.from_records(friend_list)

In [28]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2  Yunju  23    student

In [31]:
# 만약 2번 column이 필요하지 않다면 iloc를 사용한다. 즉, job이 필요없다.
df.iloc[:,0:2]  #:을 써 주어야 함.

       0   1
0   John  20
1  Jenny  30
2  Yunju  23

In [33]:
df.iloc[0:2,0:2]

       0   1
0   John  20
1  Jenny  30

# by column name

In [34]:
friend_list=[{'name': 'Jone', 'age':20,'job':'student'},
{'name':'Jenny','age':30,'job':None},
{'name':'yunju','age':23,'job':'student'},
{'name':'Nate','age':30,'job':'teacher'},
{'name':'Julia','age':40,'job':'dentist'},
{'name':'Brian','age':45,'job':'manager'}]
df=pd.DataFrame(friend_list)
df=df[['name','age','job']]

In [35]:
df

    name  age      job
0   Jone   20  student
1  Jenny   30     None
2  yunju   23  student
3   Nate   30  teacher
4  Julia   40  dentist
5  Brian   45  manager

In [36]:
df_filter=df[['name','age']]

In [37]:
df_filter

    name  age
0   Jone   20
1  Jenny   30
2  yunju   23
3   Nate   30
4  Julia   40
5  Brian   45

In [38]:
df.filter(items=['age','job'])  #윗 줄과 결과가 똑같음

   age      job
0   20  student
1   30     None
2   23  student
3   30  teacher
4   40  dentist
5   45  manager

In [40]:
df.filter(like='a',axis=1)  #컬럼 이름이 a가 들어간 것만 조회

    name  age
0   Jone   20
1  Jenny   30
2  yunju   23
3   Nate   30
4  Julia   40
5  Brian   45

In [43]:
df.filter(regex='b$',axis=1)    #정규식을 사용한 것임

       job
0  student
1     None
2  student
3  teacher
4  dentist
5  manager

In [45]:
df.filter(regex='e$',axis=1)

    name  age
0   Jone   20
1  Jenny   30
2  yunju   23
3   Nate   30
4  Julia   40
5  Brian   45